Autodesk.Revit.DB.Events.PostDocEventArgs.Document
The document associated with the event.

Autodesk.Revit.DB.Events.PostDocEventArgs
The class is used as base class for arguments of any post-event that is associated to a particular Document.